[
  {
    "title": "Abundance",
    "author": "Ezra Klein",
    "isbn13": "9781668023488",
    "rating": 3,
    "dateRead": "2026/02/15",
    "shelf": "read",
    "review": "This ended up being much more rote anecdote recital than I anticipated it being. Did you know the penicillin took a while to become famous? Did you know that operation warp-speed worked? Did you know that mRNA vaccines were thought to be useless for a long time? The points were *belabored*.\n\nI was hoping for more substantive policy analysis and ideation, but this ended up being another book that was 100 pages too long, or 100 pages misused, that could've been the final chapter as-blog post.\n\nI like the angle Klein and Thompson come from and think its a good model for governance. What are the end-goals that democrats want to arrive at, then work backwards from there on how policy or regulatory decisions help or hamper that policy. This is a good model for governance, as well as individual action or opinion which drives policy and can help to solve nimby-ism in all of its forms - from housing to energy to national security, and so on. It's shifted the way I think about things and offers a good way forward, at least in a vacuum.\n\nMore broadly speaking; I'm going to need to see a lot of change in America, with respect to the rule of law, adherence to norms, and respect for institutions before any of the ideas in this book will make any progress, rather than lead to the further dismantling of our nation and descent into authoritarian disaster. \n\nThis book is idealistic, as I believe that most left-leaning people are. We want to see the world as it could be, with a good-faith opposition party that can be compromised with and who also share the same vision for America, but who disagree on the path forward.",
    "pageCount": 304,
    "yearPublished": 2025
  },
  {
    "title": "Paradais",
    "author": "Fernanda Melchor",
    "isbn13": "9781913097875",
    "rating": 4,
    "dateRead": "2026/02/11",
    "shelf": "read",
    "review": "This was an unhinged, wildly propulsive crime novella, read for the February edition of the Anthony Jeselnik book club. 110 pages and finished it in just a couple sessions. \n\nThe writing in this is unbelievably good, even its translation. I wonder what it's like in the native Spanish. The sentences go on for what feels like pages at a time, stopping, starting, shifting tone, bringing in new tangents that read exactly like what's going on in an alcohol addicted, sex-obsessed, mysoginistic, violence fetishizing 16 year old boys brain. \n\nThis isn't something I likely would've picked up for myself, and what a ride.",
    "pageCount": 118,
    "yearPublished": 2022
  },
  {
    "title": "Atmosphere",
    "author": "Taylor Jenkins Reid",
    "isbn13": "9780593158722",
    "rating": 3,
    "dateRead": "2026/01/29",
    "shelf": "read",
    "review": "3.66 stars\n\nThis is just a fine book with a good ending. It’s a page turner and an easy read. \n\nI have some structural issues with this book, that the impact of certain events would’ve been higher had they been reordered. Too many characters are introduced all at once, and their future is set before you get a chance to know any of them. Some characters are simple tropes of, the wisecracking friend, the so monstrous as to be unrealistic embittered sister, the bitch you work with who no one likes(but everyone, I guess, actually does like?)\n\nThere are some nice passages about love that are immediate undercut with hamfisted writing. \n\nThe themes of the book are good and powerful and properly emotionally manipulated me in the ending, even though I’m still not too sure who Joan and Vanessa actually are. They are because TRJ tells us they are. And new parts of their character appear because TRJ tells us they are. Way more tell than show here. Not that I have a lot of faith that more would’ve been done with them, but I bet a lot of my qualms with this book could’ve been fixed if it had been another 50-75 pages.",
    "pageCount": 341,
    "yearPublished": 2025
  },
  {
    "title": "Amusing Ourselves to Death: Public Discourse in the Age of Show Business",
    "author": "Neil Postman",
    "isbn13": "9780143036531",
    "rating": 5,
    "dateRead": "2026/01/27",
    "shelf": "read",
    "review": "This book was mind altering and I consider a must read for anyone interested in the way we communicate and the general state of the world. \n\nWritten in 1982 primarily about TV, this book is a crystal ball and has accurately predicted everything that has happened, especially with the advent of the internet. \n\nThe central point of this book is that the medium in which we receive information changes its content. It then follows that the way Americans in particular receive information transitioning from from books, being long form expressions of thought with the purpose of imparting information, to television, whos primary purpose is to entertain first, has altered us in ways that diminished our ability to think, drowned us in ephemeral trivialities, and we don’t even give a shit because we’re entertained. \n\nPostman repeatedly compares our present not to 1984, where an authoritarian regime has restricted our access to information, but to Brave New World, where we’re too entertained and placated by cotton candy entertainment to care or search our knowledge for ourselves. We survive on morsels of emotion, rather than read to understand. Tv, or the internet, cannot accurately inform because they are trying to entertain and do so in a time-limited fashion. \n\nI was already moving in this direction, trying to ignore short form video, rage bait headlines, short written content and seek out longer form journalism and essays, but Amusing Ourselves to Death has given me a hard shove and additional context to evaluate what I’m consuming through the lens of its format. \n\nIncredible stuff.",
    "pageCount": 184,
    "yearPublished": 2005
  },
  {
    "title": "Crossroads",
    "author": "Jonathan Franzen",
    "isbn13": "9780374719791",
    "rating": 4,
    "dateRead": "2026/01/15",
    "shelf": "read",
    "review": "A longish tale of a family, divided by generations and their individual requests to find peace, overcome their childhood traumas, and family lives through Jesus, religion, acts of service, drugs, adultery, or self-flagellation. \n\nThe further I got into this book, the more I liked it. It's tremendously well written and Franzen creates some of the most well drawn, three dimensional, real, and flawed characters. There's plenty to chew on, the way the characters fall in and out of their relationships with Jesus, with each other, and with family, the ethics of war and service, but it rarely made me FEEL. For me, this book was much more head over heart, and the relative lack of heart effect is why this book is a 4 vs 5 star.\n\nI want to re-read The Corrections now and I will most certainly finish this trilogy as Franzen releases other parts.",
    "pageCount": 681,
    "yearPublished": 2021
  },
  {
    "title": "Wild Dark Shore",
    "author": "Charlotte McConaghy",
    "isbn13": "9781250827999",
    "rating": 2,
    "dateRead": "2025/12/22",
    "shelf": "read",
    "review": "This book is kind of a mess. It’s trying to be a lot of things at once, a thriller, a romance, a commentary on climate change and the nihilism that comes from it, a study of grief and loss. There’s plenty of ideas here, but I don’t think it explored any of them very successfully. \n\nThe characters have rapidly changing motivations. They make decisions or start feeling certain ways inorganically and suddenly \n\nI have absolutely no idea what age any of the kids are supposed to be. They are said to be certain ages, but act or talk in ways that are wildly older or younger. \n\nThis feels like a book that’s begging for a movie adaptation. It’s written cinematically: lots of rain, dramatic set pieces, suspense and villianary. I bet it could be a decent enough Netflix movie",
    "pageCount": 307,
    "yearPublished": 2025
  },
  {
    "title": "Fahrenheit 451",
    "author": "Ray Bradbury",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2025/12/12",
    "shelf": "read",
    "review": "I never read this in high school. Perhaps I was assigned it, but I definitely didn't read it.\n\nThe thoughts in this book are so ingrained in culture now that its hard to not read this with a \"I'm 14 and this is deep\" scoff. I have no idea how I would've perceived this in 1953. In many ways, I'm comforted by the feeling of \"everyone is getting so enamored with new technology, no one even thinks or reads anymore\" that occurred in the 50's. It makes me feel better about those same feelings existing 70 years later. It's \"these damn lazy kids\" all the way down. The world always has been, and always will be, somewhat fucked. \n\nThe dialogue in this book reads exactly like a 1950's movie. Its stilted and odd and, at least to modern ears, unnatural. Long soliliques and exposition abound.",
    "pageCount": 249,
    "yearPublished": 2011
  },
  {
    "title": "The Most Fun We Ever Had",
    "author": "Claire Lombardo",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2025/12/01",
    "shelf": "read",
    "review": "4.5 stars, rounded down on good reads. \n\nA story of the seasons of life. A fascinating and lovingly told story of the 50 years of a families life together, from the parents first meeting to their eldest daughter’s 40th birthday. \n\nA little contrived at times, and not all the family characters as well fleshed out as others, but beautiful descriptions of love, marriage, parenthood, and growing together and growing individually without growing apart.",
    "pageCount": 624,
    "yearPublished": 2019
  },
  {
    "title": "Doppelganger: a Trip into the Mirror World",
    "author": "Naomi Klein",
    "isbn13": "9780374610333",
    "rating": 5,
    "dateRead": "2025/11/14",
    "shelf": "read",
    "review": "A fascinating and wildly intellectually stimulating cultural critique of, well, everything. \n\nCovid, right wing grifts, left wing purity tests, anti-semetism, capitalism, our collective ability to obscure or wash over the bad things we’ve done in self preservation, intellectual cowardice giving way to extreme levels of intellectual dishonesty. \n\nThis was a great read and highly recommend it to anyone, especially those who are left of center and want to better understand how “our” actions and thought processes have opened the doors to evils.",
    "pageCount": 397,
    "yearPublished": 2023
  },
  {
    "title": "Inherent Vice",
    "author": "Thomas Pynchon",
    "isbn13": "9781594202247",
    "rating": 4,
    "dateRead": "2025/11/02",
    "shelf": "read",
    "review": "The writing in this is beautiful and difficult.\n\nI was able to follow the plot, but would get lost minute to minute in the writing and have to flit back to understand who I was reading about. This could've been a personal focus issue, reading on a paper book vs normal kindle consumption, or a feature of the writing itself.\n\nI was experiencing the doper-brain memory loss of Doc through the book. I imagine a lot of this was intentional, but theres enough going on in my brain right now that I'm not so sure.\n\nAnyway, fun read, really funny. Something I'll revisit again in the future.",
    "pageCount": 369,
    "yearPublished": 2009
  },
  {
    "title": "Dream State",
    "author": "Eric Puchner",
    "isbn13": "9780385550673",
    "rating": 4,
    "dateRead": "2025/09/29",
    "shelf": "read",
    "review": "4.25\n\nThis book sort of leveled me, the last quarter especially on aging and maintaining, and the meaning, a marriage in spite of tragedy and circumstances that began it in the first place.",
    "pageCount": 430,
    "yearPublished": 2025
  },
  {
    "title": "Beautyland",
    "author": "Marie-Helene Bertino",
    "isbn13": "9780374721893",
    "rating": 4,
    "dateRead": "2025/08/26",
    "shelf": "read",
    "review": "Beautiful. \n\nThis book follows the life of an alien disguised as a woman from birth to the end. It is not an ”alien” story or science fiction. It’s an EXTREMELY human story about humanity. \n\nThis book, along with my daughter starting kindergarten, really made it hit that she’s her own person with her own life who will have her own private experiences that I will never know. \n\nYour children start as your entire world, and are only exposed to what you show them and share it all with you, and slowly leave a day at a time and have a perception of the world that’s entirely unique to them",
    "pageCount": 338,
    "yearPublished": 2024
  },
  {
    "title": "Leave the World Behind",
    "author": "Rumaan Alam",
    "isbn13": "9780062667656",
    "rating": 4,
    "dateRead": "2025/08/25",
    "shelf": "read",
    "review": "Alarming.\n\nMaybe I should start setting up a doomsday bunker.",
    "pageCount": 256,
    "yearPublished": 2020
  },
  {
    "title": "Supercommunicators: How to Unlock the Secret Language of Connection",
    "author": "Charles Duhigg",
    "isbn13": "9780593243930",
    "rating": 0,
    "dateRead": "2025/08/22",
    "shelf": "read",
    "review": "As good or better than any \"Self Help\" type book I've read. It's mostly a book and the anecdotes are more important to explaining the point rather than just existing to make the page count worthy of a book instead of a substack post.\n\n It's still mostly telling you the things you already implicitly know, but it's good to see them written out in plain English.",
    "pageCount": 307,
    "yearPublished": 2024
  },
  {
    "title": "James",
    "author": "Percival Everett",
    "isbn13": "9780385550376",
    "rating": 3,
    "dateRead": "2025/08/13",
    "shelf": "read",
    "review": "3.5*\n\nI'm glad I read it, but I didnt love it. A great thought exercise and writing prompt. Huck Finn, but from Jim's perspective, is a great hook and likely got a lot more people to read this book than would've otherwise, but I ultimately felt like this would've been a better book untethered from it. I read this book off its reputation, not because of my affinity for the story of Huck Finn. \n\nEverything that's effective about this book, the code switching, the first person view of the horrors of slavery, the vengeance, the interrogation of the contemporary thinkers of the 1800's all could've been done in an original story. \n\nThis did make me look up what Brad Renfro, the Huck to JTT's Tom Sawyer, is up to. As it turns out, thats another sad story.",
    "pageCount": 304,
    "yearPublished": 2024
  },
  {
    "title": "The Nix",
    "author": "Nathan  Hill",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2025/08/09",
    "shelf": "read",
    "review": "4ish. \n\nBig stretches of brilliance and some small to medium stretches of wandering. I wouldn’t call this novel unfocused, but maybe slightly too many things within its scope. \n\nVery funny passages mixed with emotion. There’s a lot of what I loved about Wellness in here, and the improvement from this book to that is remarkable",
    "pageCount": 754,
    "yearPublished": 2016
  },
  {
    "title": "Martyr!",
    "author": "Kaveh Akbar",
    "isbn13": "9780593537626",
    "rating": 3,
    "dateRead": "2025/07/20",
    "shelf": "read",
    "review": "3.5 or maybe 3.75, but ultimately felt this book was less than the some of its parts. \n\nFantastically written in both the prose and poetry. There are interesting and insightful sections and stanzas that are really affecting, but it didn’t quite connect with me as much as I hoped it ever would. Cyrus situation couldn’t be further from my own. This book might not be for me, but it was nice to get a glimpse from his shoes. \n\nAkbar also used the word “winced” way too often.",
    "pageCount": 313,
    "yearPublished": 2024
  },
  {
    "title": "Careless People: A Cautionary Tale of Power, Greed, and Lost Idealism",
    "author": "Sarah Wynn-Williams",
    "isbn13": "9781250391247",
    "rating": 3,
    "dateRead": "2025/07/11",
    "shelf": "read",
    "review": "Yea, turns out this Mark and Sheryl characters are bad people. Or careless people, as the title said. \n\nIf you’ve been paying attention, there’s not a lot of brand new revelations in here aside from what appears to also be a culture of sexual harassment. \n\nZuck wants growth at all costs and doesn’t care who dies, kills themselves, gets depressed, gets imprisoned, who he sells out to, in order to do that. He lives so far in his own insane bubble that he thinks he could be president.",
    "pageCount": 382,
    "yearPublished": 2025
  },
  {
    "title": "North Woods",
    "author": "Daniel       Mason",
    "isbn13": "",
    "rating": 2,
    "dateRead": "2025/07/06",
    "shelf": "read",
    "review": "Technically brilliant. Extremely well written and showcasing a huge diversity of styles and evolution of the English language. I have no complaints with the writing or structure or themes or point of the book. \n\nI’ve just come to find I don’t like collections of short stories in a structure like this. \n\nNot for me, but I wouldn’t put anyone off this book.",
    "pageCount": 320,
    "yearPublished": 2023
  },
  {
    "title": "Wellness",
    "author": "Nathan  Hill",
    "isbn13": "9780593536124",
    "rating": 5,
    "dateRead": "2025/06/22",
    "shelf": "read",
    "review": "This isn’t a perfect book. It’s also 2-3 different books rolled up into one, but this might be my new favorite book. I’ve never wanted to start reading-reading a book as soon as I completed it like I have this one. \n\nIt’s perfect in its imperfection, much like Jack and Elizabeth, and frankly marriage is. I was engrossed in it, through its primary plot, divergences into history and technology, in its deep and specific telling of a relationship in the micro and macro. \n\nThis easily gets a half star bump for me because of the Chicago of it all, but I think it stands well enough on its own.",
    "pageCount": 689,
    "yearPublished": 2023
  },
  {
    "title": "All Fours",
    "author": "Miranda July",
    "isbn13": "9780593190289",
    "rating": 2,
    "dateRead": "2025/06/07",
    "shelf": "read",
    "review": "¯\\_(ツ)_/¯",
    "pageCount": 333,
    "yearPublished": 2024
  },
  {
    "title": "Black Pill: How I Witnessed the Darkest Corners of the Internet Come to Life, Poison Society, and Capture American Politics",
    "author": "Elle Reeve",
    "isbn13": "9781982198909",
    "rating": 4,
    "dateRead": "2025/05/30",
    "shelf": "read",
    "review": "",
    "pageCount": 304,
    "yearPublished": 2024
  },
  {
    "title": "In Cold Blood",
    "author": "Truman Capote",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2025/05/23",
    "shelf": "read",
    "review": "",
    "pageCount": 368,
    "yearPublished": 2001
  },
  {
    "title": "Scarcity Brain: Fix Your Craving Mindset and Rewire Your Habits to Thrive with Enough",
    "author": "Michael Easter",
    "isbn13": "9780593236635",
    "rating": 3,
    "dateRead": "2025/05/14",
    "shelf": "read",
    "review": "I like Michael Easter as a writer and as a thinker and as a guy. \n\nFor me, not a whole lot of new information or insights, but it’s all put together in a decent enough package.",
    "pageCount": 299,
    "yearPublished": 2023
  },
  {
    "title": "All the Rage: Mothers, Fathers, and the Myth of Equal Partnership",
    "author": "Darcy Lockman",
    "isbn13": "9780062861467",
    "rating": 5,
    "dateRead": "2025/04/22",
    "shelf": "read",
    "review": "It's ludicrous that most of the reviews for this book on Goodreads are by women. It's got a pink cover and its 'about' the strain endured by mothers and wives, but this is a book, in my opinion, for men and husbands more than it is for women. I will be recommending this book to my dad friends.\n\nThis is a book I wish I had read before we had our first child. With our second on the way, what better time than now. As a father and as a husband, I do consider myself to be \"one of the good ones\", but also unequivocally know that the balance between my wife and I's child related mental energy is unequal. Reading this book has further encouraged me to take a more active role and notice the areas where female default parenthood is reinforced.\n\nI did, and still do, think that the responsibility of sharing the mental load of child related tasks is shared. Men need to notice more, act proactively, and volunteer responsibility. Women need to communicate what they are doing, what needs to be done that they've noticed, and allow men to do things wrong enough times to learn.\n\nGoing into this book, based off many of the reviews here, I was expecting this to be a man hating fest. I found it to be incredibly fair and sympathetic to both genders, laying the fault of the unequal division of labor first and foremostly as a patricarchical society problem, then at the feed of men and women in child raising relationships. \n\nMany reviews have pointed out that this book doesnt offer many solutions. To the exasperated wife reading this and saying 'YES!' thats probably true if they're reading this book and closing it. The solution is to give this book to your husband, for them to tell their friends, to encourage change in your own household so that the seeds may grow.",
    "pageCount": 355,
    "yearPublished": 2019
  },
  {
    "title": "The One",
    "author": "John Marrs",
    "isbn13": "",
    "rating": 2,
    "dateRead": "2025/04/15",
    "shelf": "read",
    "review": "2 stars. For a book club.\n\nI was thinking (hoping?) that this book would be a bit more contemplative about the nature of love, whether its predestined or something you arrive at, how it can change over time or how bodies react to each other. It was, for about 5% of its content. \n\nLargely, this book is concerned with making the most dramatic choices for its underwritten characters as it can. The themes of love, technology, the role and influence of \"scientific decisions\" on our actions, all take the back seat, or third row seat, or last seat on the bus compared to making its characters suffer or turn into supervillians, or enact the largest twists and turns possible.\n\nI'm reticent to say the book is *bad*, but I don't think it was particularly good. \n\nThe characters are thin, and as noted by other reviewers - the female characters are mostly without any agency. They are enacted upon, or manipulated, or worse, by the male characters. The dialogue is poorly written and the impact of the content is minimized by its writing and overall fast pace. \n\nThe chapters are 1-5 pages each and you can whip through this book extremely quickly.",
    "pageCount": 418,
    "yearPublished": 2018
  },
  {
    "title": "Lonesome Dove (Lonesome Dove, #1)",
    "author": "Larry McMurtry",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2025/04/09",
    "shelf": "read",
    "review": "4.5 Stars.\n\nMen will literally drive a thousand head of cattle 3000 miles instead of going to therapy.\n\nThis is the longest book I've read, but never once felt like a slog. It's a relatively easy read, which is good because of its length, and was easy to get through. Simple language, but provides vivid detail in both scenery and it's characters, which are mostly three dimensional and fully realized.\n\nThis book, to me, is about what happens to men without a purpose, without a woman, or what happens when to their world when their identity is wrapped in conquering. 'Alexander wept, for there were no more world to conquer'. It's about what happens to other men who idolize and follow these lost 'men while searching for their own purpose. Its about how poorly women were treated that even without one of these lost men, how agency-less they were in the 1800's, doomed to idleness, psychosis, or old-fashioned whoring. \n\nA new untamed wilderness has its allure, but a lot of people are going to get harmed because you're getting bored.",
    "pageCount": 964,
    "yearPublished": 2010
  },
  {
    "title": "Hillbilly Elegy: A Memoir of a Family and Culture in Crisis",
    "author": "J.D. Vance",
    "isbn13": "9780062872258",
    "rating": 3,
    "dateRead": "2025/03/11",
    "shelf": "read",
    "review": "I put a hold on this after Trump/Vance won the 2024 election. It took a while to muster up the energy to read it. \n\n1. I learned a hell of a lot more about the mindset and structural and individual circumstances of the white appalachian poor from Demon Copperhead and would recommend you read that book instead. From my very outside point of view, fiction painted a better, and more fair, picture of them and their mindeset in the 2024 election than JD's non-fiction.\n\n2. This is a totally fine and well written enough memoir of a 30 year old who had lived a troubled life and pulled himself from poverty. I am flabbergated that this became such a runaway best seller and offered \"such a window into the poverty life of the Appalachian poor\". This is prime example of right time/right place for success.\n\n3. This book predates JD's political career, so I dont really expect him to have answers or policy proposals here, but its an awful lot of questions and ideation, not a lot of substance or working out the answers to those questions. \"why are we this way? Is it the governments fault? Is it our own fault? Are we just lazy? Are we too drug addictioned to care? Should we just bootstrap it\". the answer is somewhere in the middle, but I get the feeling JD wants to think and not really create an answer for the group because he got out.  \n\nThere's an awful lot of doublespeak in this book; blaming the poor for their poverty, blaming the government for being TOO generous, blaming specific individuals for their laziness without any knowledge of their circumstances, as well as blaming the structures that seperated wealth from middle sized towns through applachia and the rust belt. There's plenty of blame to go around, but I can't help but feel leaving this book that JD both understands how lucky he was to have some semblance of normalcy with Mamaw, but also taking the fact that he made it out as a symbol that anyone else who didnt just didnt work hard enough or was just unlucky. And to anyone who is unlucky or didnt work hard, too bad.",
    "pageCount": 274,
    "yearPublished": 2018
  },
  {
    "title": "Help Wanted",
    "author": "Adelle Waldman",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2025/03/06",
    "shelf": "read",
    "review": "This book was extremely good.\n\nAn incredibly low-stakes drama about the people working in a warehouse in a Target-like store scheming over who will be promoted. Intrigue abound.\n\nIncredibly well drawn characters chronicling the lives and circumstances of the haves and have-nots in a small NY town where industry has abandoned it. \n\nAnyone who's worked retail will recognize these people, and anyone who hasn't should check this book out. These are the people who make your world operate",
    "pageCount": 282,
    "yearPublished": 2024
  },
  {
    "title": "Remarkably Bright Creatures",
    "author": "Shelby Van Pelt",
    "isbn13": "9780063204171",
    "rating": 2,
    "dateRead": "2025/02/26",
    "shelf": "read",
    "review": "I wish this was more about the octopus and less about him being an omniscient god. \n\nNot awful, but contrived as hell.\n\nLittle character development or even character building to speak of. \n\nThe octopus is an omniscient all seeing super animal because he is. \n\nCameron is a genius and misunderstood diamond in the rough because he just is.",
    "pageCount": 362,
    "yearPublished": 2022
  },
  {
    "title": "Stolen Focus: Why You Can't Pay Attention—and How to Think Deeply Again",
    "author": "Johann Hari",
    "isbn13": "9780593138526",
    "rating": 5,
    "dateRead": "2025/02/19",
    "shelf": "read",
    "review": "Basically we're all fucked, or at least up against improbable odds against the internet, social media, pollution, our diets, and our general human reward seeking circuitry.\n\nDo your best to exercise, get outside, allow yourself to be bored and not constantly scratching the itch of new information, eat good food, and remove as much distratction from your life as possible.",
    "pageCount": 348,
    "yearPublished": 2022
  },
  {
    "title": "Redwall (Redwall, #1)",
    "author": "Brian Jacques",
    "isbn13": "",
    "rating": 5,
    "dateRead": "2025/02/05",
    "shelf": "read",
    "review": "My favorite book from when I was 11 years old. It gets a 5 because of my everlasting love for this series. \n\nIn re-reading, I was sort of surprised at how often Matthias fucks off to the forest without telling anyone and sort of leaves the Abbey in a lurch and how actual little warrior-ing he does.",
    "pageCount": 352,
    "yearPublished": 2017
  },
  {
    "title": "Say Nothing: A True Story of Murder and Memory in Northern Ireland",
    "author": "Patrick Radden Keefe",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2025/02/03",
    "shelf": "read",
    "review": "4.5 stars.\n\nI knew little about The Troubles going into this. This book paints a picture of a country in divide, tribal identity and radicalization, poverty and its affects on people the sociopathy of violent conflict, and how everyday people can get swept up into these things. Seems pretty relevant doesnt it?\n\nPatrick Radden Keefe is SO good at writing narrative nonfiction. This is a ton of research and learning and synthesizing into a story that reads so easily.",
    "pageCount": 464,
    "yearPublished": 2019
  },
  {
    "title": "The Anxious Generation: How the Great Rewiring of Childhood Is Causing an Epidemic of Mental Illness",
    "author": "Jonathan Haidt",
    "isbn13": "9780593655047",
    "rating": 4,
    "dateRead": "2025/01/29",
    "shelf": "read",
    "review": "",
    "pageCount": 395,
    "yearPublished": 2024
  },
  {
    "title": "Breath: The New Science of a Lost Art",
    "author": "James Nestor",
    "isbn13": "9780735213616",
    "rating": 2,
    "dateRead": "2025/01/15",
    "shelf": "read",
    "review": "2/3rds of this book is  psuedoscience bullshit about how people in the 1800's or earlier believed and proved that breathing could cure autoimmune disorders, cancer, polio, whatever just by holding your breath and maybe we shouldnt be so quick to use science to say thats incorrect. But those people also though drilling holes in your head would cure headaches or that witches caused illness.\n\nI dont beleive for a second I can cure or manage my MS just by taking some deep breaths. \n\nWe probably dont pay enough attention to breathing and its effect on the nervous system. Turns out mouth breathing actually is really bad for you and breathing exercises can affect athletic performance and relaxation.\n\nThe author finally gets around to admitting in the epilogue that breathing exercises are good for general people with asthma, anxiety, and headaches and if you have an actually medical problem, go see a doctor.",
    "pageCount": 280,
    "yearPublished": 2020
  },
  {
    "title": "Feel-Good Productivity: How to Do More of What Matters to You",
    "author": "Ali  Abdaal",
    "isbn13": "9781250865038",
    "rating": 3,
    "dateRead": "2025/01/15",
    "shelf": "read",
    "review": "A solid collection of ideas on productivity through the lens of what matters to you and avoiding burnout by orienting your life around important things. \n\nBetter than other “self helpy” type productivity books, but not as good as Oliver Burkemans 4000 weeks. Read 4000 weeks instead.",
    "pageCount": 304,
    "yearPublished": 2023
  },
  {
    "title": "The Barn: The Secret History of a Murder in Mississippi",
    "author": "Wright Thompson",
    "isbn13": "9780593299838",
    "rating": 4,
    "dateRead": "2025/01/11",
    "shelf": "read",
    "review": "",
    "pageCount": 439,
    "yearPublished": 2024
  },
  {
    "title": "Bullshit Jobs: A Theory",
    "author": "David Graeber",
    "isbn13": "9781501143311",
    "rating": 4,
    "dateRead": "2024/12/30",
    "shelf": "read",
    "review": "The first part of this book was an absolute bullet in the brain of my professional career. The later parts were a thorough and lengthy theory into why my bullshit jobs exist and the circumstances that creates them. \n\nA hugely recommended read to anyone else with a bullshit job or wants a theoretical understanding of why their non-bullshit job is paid so low compared to their spouses absolutely bullshit job.",
    "pageCount": 335,
    "yearPublished": 2018
  },
  {
    "title": "Dopamine Nation: Finding Balance in the Age of Indulgence",
    "author": "Anna Lembke MD",
    "isbn13": "",
    "rating": 3,
    "dateRead": "2024/12/13",
    "shelf": "read",
    "review": "Interesting, but substantially more academic that I thought it would be. This seems much more geared to people with addiction issues or for mental health professionals. \n\nWill be a great read for my therapist wife.",
    "pageCount": 297,
    "yearPublished": 2021
  },
  {
    "title": "Who Not How: The Formula to Achieve Bigger Goals Through Accelerating Teamwork",
    "author": "Dan  Sullivan",
    "isbn13": "9781401960599",
    "rating": 1,
    "dateRead": "2024/12/05",
    "shelf": "dnf",
    "review": "Absolutely and completely blown away by the high star rating of this book.\n\nOne of the worst books I have ever read. The content, the writing, the absolute repetition of paragraph after paragraph, the kernal of an idea just stretched and stretched and streched. \n\nI'd call it self-aggrandizing, but the person its 'aggrandizing' isnt even the writer of the book? Its got an extremely weird voice. Written by someone whos writing on behalf of the idea maker of 'delegate everything you possibly can to someone and dont do any work besides delegation'.\n\nThis is not a book, its an infomerical for this guy's stupid leadership, 10x mindset, alpha, bullshit.\n\nTruly bad stuff.",
    "pageCount": 193,
    "yearPublished": 2020
  },
  {
    "title": "Demon Copperhead",
    "author": "Barbara Kingsolver",
    "isbn13": "",
    "rating": 5,
    "dateRead": "2024/12/04",
    "shelf": "read",
    "review": "",
    "pageCount": 550,
    "yearPublished": 2024
  },
  {
    "title": "Euphoria",
    "author": "Lily King",
    "isbn13": "",
    "rating": 3,
    "dateRead": "2024/11/12",
    "shelf": "read",
    "review": "",
    "pageCount": 274,
    "yearPublished": 2023
  },
  {
    "title": "Pappyland: A Story of Family, Fine Bourbon, and the Things That Last",
    "author": "Wright Thompson",
    "isbn13": "9780735221260",
    "rating": 4,
    "dateRead": "2024/10/30",
    "shelf": "read",
    "review": "I Rip(van winkled)ped through this book.\n\nThe story is about the Van Winkle family and the story of their bourbon, but this is ABOUT family, roots, and legacy. The things we inherit from our parents and pass down to our children, purposefully or not. \n\nAs a father to a young girl and with a baby boy on the way, Wright reckoning with his place in the world and the things he wants to set up for his family hit me right between the eyes. \n\nI think Wright Thompson is an incredible writer and I love to read or listen to him talk about everything.",
    "pageCount": 256,
    "yearPublished": 2020
  },
  {
    "title": "Chip War: The Fight for the World's Most Critical Technology",
    "author": "Chris   Miller",
    "isbn13": "9781982172022",
    "rating": 3,
    "dateRead": "2024/10/10",
    "shelf": "read",
    "review": "Martin Sheen on the phone \"Micwopwocessas\"\n\nLeo DiCaprio on the other end of the phone \"Micro WHAT???\"\n\nChip war is less like The Departed than I had imagined.\n\nStill a very good read about the history of the microchip industry and then spirals out dramatically into a complex web of geopolitics, supply chain, and national interests above globalization.",
    "pageCount": 463,
    "yearPublished": 2022
  },
  {
    "title": "Medium Raw: A Bloody Valentine to the World of Food and the People Who Cook",
    "author": "Anthony Bourdain",
    "isbn13": "9780061998065",
    "rating": 4,
    "dateRead": "2024/09/30",
    "shelf": "read",
    "review": "",
    "pageCount": 288,
    "yearPublished": 2010
  },
  {
    "title": "Kitchen Confidential: Adventures in the Culinary Underbelly",
    "author": "Anthony Bourdain",
    "isbn13": "9781596917248",
    "rating": 5,
    "dateRead": "2024/09/23",
    "shelf": "read",
    "review": "\"I write, I eat, I travel.\" and this is where it starts.\n\nThis is my second read of this book, having last read it 10+ years ago and forgotten most of it. Anthony Bourdain is a better writer than most people who get paid exclusively for writing. I read this book entirely in his voice, and his voice comes through strongly in the phrasing, word choice, and style. He was as he comes across in this book.\n\nIs this actually a 5 star book? No. It's a 3.5 or 4 star book, but it gets moved up substantially on the legacy of Anthony Bourdain. A flawed, but principled man who was always eager to learn, grow, re-categorize his life, learn from his mistakes, and improve.",
    "pageCount": 321,
    "yearPublished": 2008
  },
  {
    "title": "60 Songs That Explain the '90s",
    "author": "Rob Harvilla",
    "isbn13": "9781538764947",
    "rating": 4,
    "dateRead": "2024/09/17",
    "shelf": "read",
    "review": "A very very funny book, living within your perception of popular music and how it shapes your life and the power it has. \n\nNot so much specific music criticism as a celebration and analysis of living a life surrounded by music.\n\nA fast read and recommended for anyone who grew up during the 90's and likes music",
    "pageCount": 281,
    "yearPublished": 2023
  },
  {
    "title": "Booth",
    "author": "Karen Joy Fowler",
    "isbn13": "9780593331446",
    "rating": 4,
    "dateRead": "2024/09/10",
    "shelf": "read",
    "review": "Extremely well written and beautiful language and a story about how the actions of one family member affect all of the others. This is true from parents to kid, kid to parent, sibling to sibling.\n\nFrom a narrow perspective of the Booth family and John Wilkes Booth assassinating Lincoln, \n\nthis is kind of like, when Martin Sheen was on the West Wing and Charlie Sheen was incredibly famous on Two and a Half Men, Emilio Estevez shot and killed George W Bush.",
    "pageCount": 480,
    "yearPublished": 2022
  },
  {
    "title": "Right Thing, Right Now: Justice in an Unjust World",
    "author": "Ryan Holiday",
    "isbn13": "9780593191729",
    "rating": 3,
    "dateRead": "2024/08/20",
    "shelf": "read",
    "review": "",
    "pageCount": 365,
    "yearPublished": 2024
  },
  {
    "title": "Die with Zero: Getting All You Can from Your Money and Your Life",
    "author": "Bill  Perkins",
    "isbn13": "",
    "rating": 1,
    "dateRead": "2024/08/18",
    "shelf": "read",
    "review": "The idea behind this book is good and I agree with it. Don’t hoard your money and make sure you use it, or give it to someone who can use it, at their peak utility according to your(their) health, wealth, and time. \n\nHaving said that, this is one of the worst books I’ve ever read. It’s a 190 pages and it’s 180 pages too long. It is the worst offender of fluff, padded writing I have ever read. In other words”self help”y books, at least sometimes they give new anecdotes to help reinforce the point. This literally repeated itself constantly. \n\nThe author is extremely out of touch with regular people   Or anyone lower than even upper middle class. The anecdotes and shared life experiences are ridiculous. \n\nLike truly awful writing and self aggrandizement.",
    "pageCount": 240,
    "yearPublished": 2020
  },
  {
    "title": "Dark Matter",
    "author": "Blake Crouch",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2024/08/06",
    "shelf": "read",
    "review": "Not as good as Recursion. \n\nStill pretty good!",
    "pageCount": 343,
    "yearPublished": 2016
  },
  {
    "title": "Man's Search for Meaning",
    "author": "Viktor E. Frankl",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2024/07/31",
    "shelf": "read",
    "review": "",
    "pageCount": 188,
    "yearPublished": 2006
  },
  {
    "title": "A Supposedly Fun Thing I'll Never Do Again: Essays and Arguments",
    "author": "David Foster Wallace",
    "isbn13": "",
    "rating": 0,
    "dateRead": "2024/07/29",
    "shelf": "read",
    "review": "Extremely well written and interesting, but ultimately kind of without point? \n\nIt's a collection of essays and long form writings from magazines/periodicals that are all very 1990's focused. I was interested, but each essay didn't reveal a lot more than the tings they were about.",
    "pageCount": 378,
    "yearPublished": 2009
  },
  {
    "title": "Recursion",
    "author": "Blake Crouch",
    "isbn13": "9781524759803",
    "rating": 5,
    "dateRead": "2024/07/17",
    "shelf": "read",
    "review": "One of the best books I’ve read. A stunner.",
    "pageCount": 324,
    "yearPublished": 2019
  },
  {
    "title": "The Algebra of Wealth: A Simple Formula for Financial Security",
    "author": "Scott Galloway",
    "isbn13": "9780593714034",
    "rating": 3,
    "dateRead": "2024/07/09",
    "shelf": "read",
    "review": "I whipped through this, which is a testament to Scott’s writing style, and also me using a flight to read rather than watch episodes of Barry. \n\nThis book is more targeted more towards college students or early adults rather than me in me in my late 30s. It’s the 101/102 level class of what it means to be a working adult in a capitalist society. How to get the best return on your education, work hours, and investments. \n\nScott combines a lot pop-psych books in the first half. Ryan holiday, Cal Newport, James Clear. Be tough, do hard things, the thing you’re best at might not be what’s your favorite thing, but could become it after hard work and mastery. Use those tools to get a high income, then convert that income to investments to make your money grow. \n\nReading this is kind of like reading many of the books on management that are out there. Stuff you already know in your heart to be true, just spelled out. Nothing in here was super revalatory for me, who’s had investments in retirement and non retirement accounts, owns a home, but I sure as hell with this book was available to me when I was 25.",
    "pageCount": 302,
    "yearPublished": 2024
  },
  {
    "title": "When McKinsey Comes to Town: The Hidden Influence of the World's Most Powerful Consulting Firm",
    "author": "Walt Bogdanich",
    "isbn13": "9780385546249",
    "rating": 2,
    "dateRead": "2024/07/03",
    "shelf": "read",
    "review": "I don’t think this was particularly good or an effective piece of writing. \n\nThe general conceit is that McKinsey is a shadowy operator that’s responsible for much of what is bad in the world today. The writers fail to convince me of that, most notably because McKinsey is the advisor to bad actors doing bad things who have asked McKinsey to help them become more bad. Should McKinsey not work with bad actors? Of course, but that would be bad for their bottom line. \n\nThe issues raised in this book are solely the issues of unregulated capitalism, “responsibility to shareholders” and profit at any cost. \n\nA similar book could be written about many companies operating today. This one chose to single out McKinsey as its daemon. \n\nOn the writing, it’s ineffective. It’s a series of 20 minute case studies of bad companies doing bad things to become more profitable where McKinsey served them as consultants. The writers will frequently bring up bad things that happened that either were directly not the result of their consultancy or ambiguous and then the writers go “coincidence???!!?!?!”. McKinsey consulted for Saudia Arabia and MBS murdered Kashoggi. McKinsey responsible? The Houston astros cheated and McKinsey worked for Enron, the field the Astros play on was named after. McKinsey responsible for cheating!?\n\nI’m not a consultant and am not absolving McKinsey of negative contributions to the world,  but if a business says “we need to be more profitable and we don’t care how” and McKinsey says “firing people or lowballing insurance settlements would work” and the company implements that advice, isn’t the company at fault if they do that? \n\nThis book is thought provoking, but mostly in the way that the book is not good.",
    "pageCount": 353,
    "yearPublished": 2022
  },
  {
    "title": "The Comfort Crisis: Embrace Discomfort To Reclaim Your Wild, Happy, Healthy Self",
    "author": "Michael Easter",
    "isbn13": "9780593138762",
    "rating": 4,
    "dateRead": "2024/06/24",
    "shelf": "read",
    "review": "Get off your phone. Go outside. Do hard things. Know that you will die. Embrace discomfort, you have it easy(physically), relative to every human that has ever lived. It will make you better and more capable.",
    "pageCount": 304,
    "yearPublished": 2021
  },
  {
    "title": "Good Inside: A Practical Guide to Resilient Parenting Prioritizing Connection Over Correction",
    "author": "Becky   Kennedy",
    "isbn13": "9780063159488",
    "rating": 5,
    "dateRead": "2024/06/17",
    "shelf": "read",
    "review": "Dr Becky is great",
    "pageCount": 336,
    "yearPublished": 2022
  },
  {
    "title": "Chain-Gang All-Stars",
    "author": "Nana Kwame Adjei-Brenyah",
    "isbn13": "9780593317341",
    "rating": 4,
    "dateRead": "2024/06/13",
    "shelf": "read",
    "review": "4.5. Book was awesome. Dystopian future, hunger games meets the running man, but with plenty to say about what the prison system does to everyone, from its inmates, the people who profit from it, normal people related or unrelated to convicts, the tools of control and fear. \n\nIncredible stuff.",
    "pageCount": 384,
    "yearPublished": 2023
  },
  {
    "title": "Of Mice and Men",
    "author": "John Steinbeck",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2024/05/22",
    "shelf": "read",
    "review": "Steinbeck dont miss",
    "pageCount": 73,
    "yearPublished": 1993
  },
  {
    "title": "The Smartest Guys in the Room: The Amazing Rise and Scandalous Fall of Enron",
    "author": "Bethany McLean",
    "isbn13": "9781591840534",
    "rating": 5,
    "dateRead": "2024/05/19",
    "shelf": "read",
    "review": "Extremely well written and easy to follow for a very very complex topic. It flows nicely and was never boring, even over 700 pages. \n\nThis was a great history lesson of something that occurred during my lifetime, but not at a point when I was really paying attention to business news.",
    "pageCount": 440,
    "yearPublished": 2004
  },
  {
    "title": "The Shamshine Blind",
    "author": "Paz Pardo",
    "isbn13": "9781982185329",
    "rating": 0,
    "dateRead": "2024/04/25",
    "shelf": "read",
    "review": "This book was such a chore to read, I ended up finishing it as an audiobook, which was much better.\n\nThe premise is great. What if Argentina becuase a super power because of an emotional control weapon. What would the world look like now?\n\nIt's extremely noir and the narration/action just moves quickly and non-sequiterly between thinking and action and exposition.IT's extremely difficult to follow and remember what's important. \n\nThere's too many characters and its a mysterly thats unravelling extremely slowly, and also very fast at times.\n\nThe writing just did not work for me and I struggled with it.",
    "pageCount": 320,
    "yearPublished": 2023
  },
  {
    "title": "Kasher in the Rye: The True Tale of a White Boy from Oakland Who Became a Drug Addict, Criminal, Mental Patient, and Then Turned 16",
    "author": "Moshe Kasher",
    "isbn13": "9780446584265",
    "rating": 4,
    "dateRead": "2024/04/23",
    "shelf": "read",
    "review": "What a complete and utter piece of shit Moshe was as a kid. \n\nI knew it was bad from his standup and appearances on podcasts, but not as bad as it was outlined here. Kids should read this instead of Go Ask Alice. You start going down a hole, then just keep going, not realizing that its a problem.\n\nI wish there was a little more about his recovery and staying sober. It just kind of happens after seeing there's no way out, but maybe thats how he experienced it. No other choice, and just doing what had to be done.\n\nThere's many many worlds where the events of Moshe's life take place and there's no story to tell, because it ends in life in prison, or death. He is aware of how awful it could've been and is reflective and aware of what a piece of shit he was.\n\nOther reviews call out that it would've been more interesting to hear the story of having two deaf parents, and what that life was like. I don't think that story exists. I think this IS the story. He felt so out of touch from his fucked up childhood that the drugs took all his attention and reflection until much later.",
    "pageCount": 303,
    "yearPublished": 2012
  },
  {
    "title": "Golf is Not a Game of Perfect",
    "author": "Bob Rotella",
    "isbn13": "9781416563310",
    "rating": 5,
    "dateRead": "2024/03/28",
    "shelf": "read",
    "review": "",
    "pageCount": 234,
    "yearPublished": 2007
  },
  {
    "title": "Golf Architecture for Normal People: Sharpening Your Course Design Eye to Make Golf (Slightly) Less Maddening",
    "author": "Geoff Shackelford",
    "isbn13": "9781732222762",
    "rating": 4,
    "dateRead": "2024/03/27",
    "shelf": "read",
    "review": "This really is a very very high level overview of golf course design and like it’s name states, is for normal people. \n\nI do struggle to think of who’s going to take the time to read this book. Probably someone who wants to know more than just the high levels. \n\nA book for new golfers or for someone who’s never thought for a minute about golf course design.  But it’s really the 101 course. \n\nGeoff write well and is funny and there’s good nuggets here, but I was hoping for more. Luckily there’s an appendix with further reading.",
    "pageCount": 181,
    "yearPublished": 2023
  },
  {
    "title": "The Making of a Manager: What to Do When Everyone Looks to You",
    "author": "Julie Zhuo",
    "isbn13": "9780735219564",
    "rating": 5,
    "dateRead": "2024/03/27",
    "shelf": "read",
    "review": "",
    "pageCount": 288,
    "yearPublished": 2019
  },
  {
    "title": "Endurance: Shackleton's Incredible Voyage",
    "author": "Alfred Lansing",
    "isbn13": "9780465058792",
    "rating": 5,
    "dateRead": "2024/03/21",
    "shelf": "read",
    "review": "Insane, crazier than fiction true story about human determination and courage and how hard it is to be cold. Also demonstrates man’s ability to be happy when the purpose is solely survival. \n\nEngaging and fast read.",
    "pageCount": 292,
    "yearPublished": 2014
  },
  {
    "title": "The Orphan Master's Son",
    "author": "Adam  Johnson",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2024/03/14",
    "shelf": "read",
    "review": "Beautifully written and interesting about humanity in North Korea.\n\nI think this one, maybe more than any other book I’ve read, would benefit from a re-read.",
    "pageCount": 459,
    "yearPublished": 2012
  },
  {
    "title": "Earthlings",
    "author": "Sayaka Murata",
    "isbn13": "",
    "rating": 0,
    "dateRead": "2024/02/15",
    "shelf": "read",
    "review": "What the fuck did I just read? I went in totally blind, having only heard the title and this wasn’t what I was expecting. \n\nThis is the most provocative book I’ve read. It pokes and prods and is begging for reaction and thought about a number of extremely taboo topics. \n\nNot quite sure that I liked it, but I’m definitely thinking about it.",
    "pageCount": 202,
    "yearPublished": 2020
  },
  {
    "title": "Number Go Up: Inside Crypto's Wild Rise and Staggering Fall",
    "author": "Zeke Faux",
    "isbn13": "9780593443828",
    "rating": 4,
    "dateRead": "2024/02/11",
    "shelf": "read",
    "review": "Crypto is an interesting thought experiment and technical challenge and ultimately a solution in search of a problem. The opaqueness of the technology allowed a bunch of tech literate people to exploit other less tech literate people who in turned exploited almost everyone. \n\nIt’s a shell game and a scam and the people in power are self interested idiots. \n\nUltimately this book is about crypto, but it’s about systems of power, class, and monetary policy that can’t keep up. Areas without existing law will attract people to make a killing and ruin the lives of people who get caught up in the hype. They’ll exploit your desperation and hope for a better life. The line goes up, and so does the money out of your pocket.\n\nEngaging and fast read. The casualness of the writing belies the length of time and amount of work that went into writing it.",
    "pageCount": 473,
    "yearPublished": 2023
  },
  {
    "title": "Comedy Comedy Comedy Drama",
    "author": "Bob   Odenkirk",
    "isbn13": "9780399180514",
    "rating": 3,
    "dateRead": "2024/02/04",
    "shelf": "read",
    "review": "Bob is a comedy idol of mine. SNL, Ben Stiller Show, Dana Carvey Show and especially Mr Show is and were a defining part of my comedy tasted and worldview. \n\nThis is a pretty straightforward telling of bobs career first, and life second. I was hoping for a little more introspection  about the man vs his projects. \n\nA somewhat funny and enjoyable listen, but not much more than a Wikipedia page.",
    "pageCount": 284,
    "yearPublished": 2022
  },
  {
    "title": "The Nineties: A Book",
    "author": "Chuck Klosterman",
    "isbn13": "9780735217973",
    "rating": 4,
    "dateRead": "2024/02/03",
    "shelf": "read",
    "review": "A good retrospective about a decade I lived entirely through, but my memories of are the collective memories of culture. Helps to explore and explain many of the things we are living through now. \n\nChucks writing has improved, but this is a little less “thinky” than his other essay collections.",
    "pageCount": 384,
    "yearPublished": 2022
  },
  {
    "title": "Outlive: The Science and Art of Longevity",
    "author": "Peter Attia",
    "isbn13": "9780593236604",
    "rating": 4,
    "dateRead": "2024/01/22",
    "shelf": "read",
    "review": "A good written and heavily distilled version of the podcast. It ends nicely with the chapter on emotion health and with Peter’s vulnerability in publishing it.\n\nNow go exercise.",
    "pageCount": 478,
    "yearPublished": 2023
  },
  {
    "title": "Blood Meridian: Or the Evening Redness in the West",
    "author": "Cormac McCarthy",
    "isbn13": "",
    "rating": 0,
    "dateRead": "2024/01/10",
    "shelf": "read",
    "review": "I’m not really sure what to do with all that I’ve read here. It’s long, difficult, sort of boring, sort of thrilling, extremely violent and bleak. \n\nProbably need to sit with this for a bit. And probably read it again",
    "pageCount": 370,
    "yearPublished": 2010
  },
  {
    "title": "Poverty, by America",
    "author": "Matthew Desmond",
    "isbn13": "9780593239926",
    "rating": 4,
    "dateRead": "2023/12/13",
    "shelf": "read",
    "review": "A very good companion piece to Evicted",
    "pageCount": 287,
    "yearPublished": 2023
  },
  {
    "title": "Evicted: Poverty and Profit in the American City",
    "author": "Matthew Desmond",
    "isbn13": "",
    "rating": 5,
    "dateRead": "2023/12/07",
    "shelf": "read",
    "review": "This was harrowing and should be required reading. I’ve never been sadder, angrier, and more empathic reading non fiction. This is America? It’s bullshit. \n\nThe author gets (through his own hard work, willingness to ethnograph, and skill) unbelievable access to the impoverished and downtrodden to chronicle what their lives are like living in constant fear, pennies a day, and nomadic lifestyles forced by routine evictions. \n\nI can’t give this book high enough praise and encourage everyone to read it.",
    "pageCount": 434,
    "yearPublished": 2016
  },
  {
    "title": "Quit Like a Woman: The Radical Choice to Not Drink in a Culture Obsessed with Alcohol",
    "author": "Holly Whitaker",
    "isbn13": "9781984825056",
    "rating": 4,
    "dateRead": "2023/11/17",
    "shelf": "read",
    "review": "Meant for women, but a very good listen for men in both an expansion of the topics discussed in This Sober Mind and also feminist perspectives",
    "pageCount": 368,
    "yearPublished": 2019
  },
  {
    "title": "This Naked Mind: Control Alcohol, Find Freedom, Discover Happiness & Change Your Life",
    "author": "Annie Grace",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2023/10/26",
    "shelf": "read",
    "review": "While doing Dry January in Jan 2023, I felt great. I felt energetic, was sleeping great, more level-headed and had level emotions. I spent every weekend morning able to get up early with my daughter and not need a nap some afternoons to shake off any cobwebs. I went out socially with friends and with family and felt as good, if not even better than I would've when drinking. I was just as (if not more) lively, funny, engaged, able to converse and have fun. For the first time in my life, I considered not drinking when the month ended. \n\nI'm not an alcoholic in the way that most people think of alcoholics. I wasn't blacking out, drinking in the morning, drinking every day, drinking at work, missing work or family responsibilities due to alcohol. This book also argues that there's no such thing, but a sliding scale of alcohol dependence because alcohol is an addictive and dangerous chemical. I do know that I drank more than I should. I had trouble stopping at 1, but never got to extreme drunkenness or dangerous levels of alcohol. If I had one beer, I'd have 4. Most of the drinking I wa doing occurred at home, on the weekends with my wife watching tv or movies. If I had beer in the house, it was more that there wasn't a reason NOT to drink, rather than a reason TO drink. If it was here, I drank it. After all, I'm an adult, this was my god given right. I was not drinking every night and didn't have issues not drinking for longer (7-10 day) periods of time.\n\n After dry January, I went back and the same patterns slowly re-emerged. \n\nI saw more and more articles and studies concluding that alcohol has zero positive health benefits and is dangerous and has ravaging effects on our anxiety levels and sleep.\n\nIn the spring, a beer blogger who I admired for his wit and finger on the pulse of the beer community I loved was diagnosed with stage 4 colon cancer. This rattled the hell out of me\n\nI wonder what example my current pattern of drinking is setting for my daughter as she grows up.\n \nI wonder what negative health outcomes drinking is having on me. I already have MS, should I be walking a line of cancer too?\n\nI wonder how much better I can be as a husband, father, and friend if I stop or radically alter my alcohol consumption.\n\nI wonder how my body would feel without inflammation, raised cortisol levels, consecutive good nights of sleep, and 3000+ less calories a week.\n\nI wonder what benefits I get from alcohol anymore. Given all the positive experiences I've had with sobriety, it's probably not many.\n\nI read this book to explore being sober. I'm not sure that I won't ever have another drink again, but I also know that I don't NEED to.",
    "pageCount": 271,
    "yearPublished": 2015
  },
  {
    "title": "Project Hail Mary",
    "author": "Andy Weir",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2023/10/18",
    "shelf": "read",
    "review": "Really fun story, easy and fast read. \n\nWier makes science very easy to read and simple, which is not always easy.\n\nThe main character is basically Mark watery from the Martian and like mark is a very good sciencey science person who knows all the science",
    "pageCount": 549,
    "yearPublished": 2021
  },
  {
    "title": "Tomorrow, and Tomorrow, and Tomorrow",
    "author": "Gabrielle Zevin",
    "isbn13": "9780735243347",
    "rating": 2,
    "dateRead": "2023/10/04",
    "shelf": "read",
    "review": "This book is about video games in as much as the Mr. Show business ice cream:\n\n\"Rock & Roll Double Chunk\". It has chocolate in it, and we figure if people like Rock & Roll music, they'll like this, cause it says \"Rock & Roll\" on it.\n\nIt was almost was a DNF, but I just had to finish reading it to see how bad it would go. The author is trying to do way too much, fit in way to many social commentaries, and be so inclusive, it ends muddled and un-pointed. \n\nIts badly written, strangely constructed, has characters that are both unlikable AND too thin to be real people. The author makes judicious use of a thesaurus and only in ways that are show-offish, rather than fit into the rest of the text.\n\nThere are small pockets of interest and of good, but I really can't believe how much praise it's received.",
    "pageCount": 399,
    "yearPublished": 2022
  },
  {
    "title": "Empire of Pain: The Secret History of the Sackler Dynasty",
    "author": "Patrick Radden Keefe",
    "isbn13": "9780385545686",
    "rating": 5,
    "dateRead": "2023/09/20",
    "shelf": "read",
    "review": "Fuck the Sackler Family",
    "pageCount": 535,
    "yearPublished": 2021
  },
  {
    "title": "The Grapes of Wrath",
    "author": "John Steinbeck",
    "isbn13": "9780670016907",
    "rating": 5,
    "dateRead": "2023/08/30",
    "shelf": "read",
    "review": "What am I going to say about this book that hasn’t already been written. \n\nIt’s supremely affecting of the head and of the heart on how capitalism steals the humanity from both the haves and the have nots. \n\nNo author in my reading up to this point has been so talented as Steinbeck. He slips in and out of beautiful detailed narration and Oklahoma vernacular so easily between chapters. The Oklahoma spoken parts are a showcase and parade for the apostrophe.",
    "pageCount": 496,
    "yearPublished": 2014
  },
  {
    "title": "The Candy House",
    "author": "Jennifer Egan",
    "isbn13": "9781476716787",
    "rating": 3,
    "dateRead": "2023/08/11",
    "shelf": "read",
    "review": "This is a candy house. We’re happy here. In this candy house. This is fun, fun, fun, fun, fun, fun whoooaaoooo\n\nI’m coming to find I much prefer a single narrative story than anthology’s or collections of smaller stories, even if they somewhat share characters or circle a theme. \n\nThe candy house is extremely well written and inventive with the form, shifting tones and style and format in each chapter. It’s full of insights and nice thoughts and feelings. I just have a hard time getting extremely invested into each characters story knowing they’re not going to be around next chapter. \n\nOverall this book does a great job handling its themes of technology, connection, isolation,  and doesn’t beat you over the head with them to the point of absurdity.",
    "pageCount": 342,
    "yearPublished": 2022
  },
  {
    "title": "How to Win Friends and Influence People in the Digital Age (Dale Carnegie Books)",
    "author": "Dale Carnegie",
    "isbn13": "9781451629163",
    "rating": 3,
    "dateRead": "2023/07/19",
    "shelf": "read",
    "review": "I listened to this as it comes up time and time\nAgain as essential or books that every manager should read. Its content is basically “yeah, no shit” and “duhhh” the book. \n\nIt’s full of valuable and good points, but will only be new to you if you have no social skills or haven’t worked in a professional environment before. \n\nIm likely not the target demographic for it. Most of its messages have been delivered to me through various channels. its always good stuff to be reminded of, but don’t come here looking for anything brand new",
    "pageCount": 251,
    "yearPublished": 2011
  },
  {
    "title": "Lessons in Chemistry",
    "author": "Bonnie Garmus",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2023/07/12",
    "shelf": "read",
    "review": "Very refreshing and important to spend some time living in the head of a woman during a particularly troubled time of the 50's(but the more things change the more they stay the same). A reminder to be cognizant of alternate perspectives and considerate of how to treat people.\n\nThe characterizations are fairly two dimensional and the ending is a bit too \"Waynes World, lets do the mega happy ending\" to keep this from a 5 star book. Elizabeth is a bit too much of a sciencey science-woman. Mad is a genius child. Six-Thirty is a good boy with a nearly full understanding of English. Calvin is the golden boy with a troubled past.\n\nAll in all, recommended read.",
    "pageCount": 386,
    "yearPublished": 2022
  },
  {
    "title": "Born Standing Up: A Comic's Life",
    "author": "Steve  Martin",
    "isbn13": "9781416553649",
    "rating": 3,
    "dateRead": "2023/06/25",
    "shelf": "read",
    "review": "3.5 stars, audiobook.\n\nGreat look into the early days of Martin's entertainment days, how he developed, shifted, and turned an act into his own, especially before \"comedy\" was really even a career path and track.\n\nFunny bits and jokes in the meat of the story. All in all a good listen.",
    "pageCount": 207,
    "yearPublished": 2007
  },
  {
    "title": "The Big Short: Inside the Doomsday Machine",
    "author": "Michael   Lewis",
    "isbn13": "9780393353150",
    "rating": 4,
    "dateRead": "2023/06/22",
    "shelf": "read",
    "review": "Michael Lewis has an extreme talent for breaking down complex and deliberately opaque topics to be easily understood and digestible to someone with no expertise. He writes what could be very dry and laborious into a compelling narrative.\n\nThe book is more effective than the film of telling this story and making the world of MBS, CDO's, subprime mortgages, etc very easily understood.\n\nIt loses some effectiveness because it focuses very little on the ripple effects of the economic meltdown into the lives of regular people or the economy. I do recognize that it's not the goal of the book and wouldve made it 78 times as long.",
    "pageCount": 291,
    "yearPublished": 2015
  },
  {
    "title": "Greenlights",
    "author": "Matthew McConaughey",
    "isbn13": "",
    "rating": 2,
    "dateRead": "2023/06/13",
    "shelf": "read",
    "review": "Matthew McConaughey seems like a dumb man's idea of a smart man, and by using the definition laid out in his book, a master bullshitter. I'm not saying he's dumb, but the writing is high school poetry, \"I'm 14 and this is deep\" type schlock. I'm also not saying my memoir or writing would be any better. \n\nMaybe this is a case of heightened expectations, but I'd heard this book being recommended highly and his introduction set me to expect wisdom, applicable life lessons, insights, and a philosophy about green lights, which never ever came. He just declared things as greenlights. It gave me a lot of stories about how chill Matthew is and how great it must be to be able to travel and live without the need for steady income and without anything tying you down, things we all wanted in our 20s.\n\nHe's an extremely talented actor, I admire the optimism, come what may attitude, and willingness to say \"yes\" to experiences and get involved. \n\nThis probably would've been much more enjoyable as an audiobook.",
    "pageCount": 253,
    "yearPublished": 2020
  },
  {
    "title": "White Noise",
    "author": "Don DeLillo",
    "isbn13": "9780143129554",
    "rating": 3,
    "dateRead": "2023/06/09",
    "shelf": "read",
    "review": "Full of clever lines and poignant views on American and modern consumer culture. Reading this made me feel that Chuck Palahniuk was very influenced by DeLillo.\n\nMy initial rating was 3 stars, but I've continued to think about it. Its well written, but moves a little fast for itself. This might also be colored by me reading it in chunks largely lying on the floor next to a sleeping sick toddler. Its full of little sticky bit that get stuck between your teeth. I might need to re-read in a few years and absorb more. \n\nBut at present, I'm just not as fascinated or concerned with death as this book is.",
    "pageCount": 320,
    "yearPublished": 2016
  },
  {
    "title": "Barbarian Days: A Surfing Life",
    "author": "William Finnegan",
    "isbn13": "9780698163744",
    "rating": 5,
    "dateRead": "2023/05/26",
    "shelf": "read",
    "review": "I thought this book was incredibly well written, stories well told, structured, and the author was introspective and interested in the decisions and life he lived and reckoning with his abilities to engage with the activity that gives him life as he ages. \n\nThis rings ESPECIALLY true now after finishing Matthew McCaungheys Greenlights, which is also a memoir in the same way that Goodfellas and Transformers: Revenge of the Fallen are both movies. \n\nI've taken a surfing lesson once on vacation, the type of lesson Finnegan sneers at towards the end of his book of the consumerization of his entire life spent on the waves. Before reading this book, I had never considered how a surfer interacts, studies, and learns each spot, each wave. Reading them, adjusting to them, learning whats good and whats bad.\n\nA hugely worthwhile read about life, passion, travel, engagement with strangers, aim and direction, and finding what's important to you.",
    "pageCount": 466,
    "yearPublished": 2015
  },
  {
    "title": "Hyperion (Hyperion Cantos, #1)",
    "author": "Dan Simmons",
    "isbn13": "9780553283686",
    "rating": 4,
    "dateRead": "2023/05/12",
    "shelf": "read",
    "review": "Each pilgrims story had its strengths and some were way better than others. It’s very impressive writing changing voice, stoey style and tone so drastically for each pilgrims tale. \n\nLike most science fiction, I don’t really care about the invented word hyper future bullshit, but this focused largely on the human experience.",
    "pageCount": 500,
    "yearPublished": 1990
  },
  {
    "title": "The Cost of These Dreams: Sports Stories and Other Serious Business",
    "author": "Wright Thompson",
    "isbn13": "9780525505662",
    "rating": 5,
    "dateRead": "2023/04/18",
    "shelf": "read",
    "review": "Wright Thompson absolutely rules. An incredible writer and storyteller, mixing capital J Journalism with opinion, self reflection, and an open mind.\n\nThese are not sports stories, they're human stories using sports as the umbrella, but the lessons are about humanity, drive, dedication, and could just as easily be applied to other \"highly succesful\" people in their field, top lawyers, businesspeople, acting, etc.\n\nIncredible book",
    "pageCount": 388,
    "yearPublished": 2019
  },
  {
    "title": "The Age of Surveillance Capitalism: The Fight for a Human Future at the New Frontier of Power",
    "author": "Shoshana Zuboff",
    "isbn13": "9781610395694",
    "rating": 4,
    "dateRead": "2023/03/27",
    "shelf": "read",
    "review": "As every other review has stated, this book is insanely well researched, detailed, thorough, and probably 30% too long. \n\nIt's absolutely chilling and has made me rethink a lot of what I use on the internet on a daily basis, how I contextualize the data I'm feeding to the machine, and what products and services will get my dollars going forward.\n\nIt's also a pretty helpless feeling, knowing this is just sort of how we live now, everything is used to sell and sell and sell. My livelihood is also dependent on this economy, being in digital marketing.",
    "pageCount": 691,
    "yearPublished": 2019
  },
  {
    "title": "How High We Go in the Dark",
    "author": "Sequoia Nagamatsu",
    "isbn13": "",
    "rating": 2,
    "dateRead": "2023/02/21",
    "shelf": "read",
    "review": "This book wasn't for me. Maybe more specifically, collections of short stories arent for me. Especially 300 pages of the bleakest circumstances imaginable. \n\nI had a real problem connecting to any of the stories in particular. As they ramped up, they finished, we moved on to the next story with a new \"I\" narrating the story. Its choppy and difficult to connect to and its really hard to get invested in anything when it ends almost immediately.\n\nIt was bleak, bleak, bleak, bleak, I found the timeline confusing, referencing current music and states with it being in the future. All the stories are \"connected\" but not in any way that was truly revealing.",
    "pageCount": 290,
    "yearPublished": 2022
  },
  {
    "title": "Exhalation",
    "author": "Ted Chiang",
    "isbn13": "",
    "rating": 0,
    "dateRead": "2023/02/13",
    "shelf": "dnf",
    "review": "DNF'ed this one after about 75%.\n\nI don't not recommend it. Perhaps I'm not just in the right headspace for it at the moment. \n\nIt's not that its poorly written, or that the kernels of the ideas in each short story aren't interesting. It just never sufficiently grabbed me. Reading it felt more of a chore and I was just hoping to get to the next story which would hopefully be more interesting.",
    "pageCount": 362,
    "yearPublished": 2019
  },
  {
    "title": "When We Cease to Understand the World",
    "author": "Benjamín Labatut",
    "isbn13": "",
    "rating": 3,
    "dateRead": "2023/01/29",
    "shelf": "read",
    "review": "If a butterfly flaps it’s wing, a big theoretical scientific advancement will take place during an incredibly horny fever dream.",
    "pageCount": 193,
    "yearPublished": 2022
  },
  {
    "title": "Properties of Thirst",
    "author": "Marianne Wiggins",
    "isbn13": "9781416573456",
    "rating": 5,
    "dateRead": "2023/01/24",
    "shelf": "read",
    "review": "This is a 4.5, but I’m making it as a 5 because I want more people to read it.",
    "pageCount": 544,
    "yearPublished": 2022
  },
  {
    "title": "Foreverland: On the Divine Tedium of Marriage",
    "author": "Heather Havrilesky",
    "isbn13": "9780062984494",
    "rating": 3,
    "dateRead": "2023/01/07",
    "shelf": "read",
    "review": "A brutally and courageously honest depiction of the authors marriage. It's impressive the things she chooses to air out in public. I truly admire the honesty and openness portrayed in this book about the couple as well as Havrilesky's choices to put them to the page and publish. There's plenty in this book that I hope does not enter my marriage. Everyone's is different.\n\nAt face value and at the beginning of each chapter, it seems like an absolute trainwreck. She seems to always pull it back together by the end and makes the lesson she learned in each portion universal to marriage itself.",
    "pageCount": 304,
    "yearPublished": 2022
  },
  {
    "title": "Heat 2",
    "author": "Michael               Mann",
    "isbn13": "",
    "rating": 5,
    "dateRead": "2022/12/31",
    "shelf": "read",
    "review": "For me…the paragraphs IS the book. \n\nThis book fucking whips.",
    "pageCount": 474,
    "yearPublished": 2022
  },
  {
    "title": "Piranesi",
    "author": "Susanna Clarke",
    "isbn13": "",
    "rating": 3,
    "dateRead": "2022/12/18",
    "shelf": "read",
    "review": "Starts off incredibly slow, but deliberate and full of world building. As it s pods up, it loses a little bit of its grounding for the sake of plot. \n\n It has a really great concept and I think there’s a lot to glean about living like Piranesi. Finding beauty in your surroundings, being content with what you are provided, charting a meaningful relationship with people and your surroundings. \n\nAs a book, It just didn’t quite stick the landing. A fun and engaging read though. Lessons to be taken from it, and isn’t that kind of the point?",
    "pageCount": 246,
    "yearPublished": 2020
  },
  {
    "title": "No Country for Old Men",
    "author": "Cormac McCarthy",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2022/11/29",
    "shelf": "read",
    "review": "I've found myself thinking about this book a lot since I finished it. Cormac is the bleakest fucking guy in the world, but man can this guy tell a story.\n\nI'm baffled by how much I can be impressed by his ability to write dialogue in true sounding Texas speaking, switch to narrative, and go back and forth. I love his dialogue and descriptive prose, but I cannot fucking stand him making compound words out of anyt two words he sees. \"Sockfeet\"??? get out of here.\n\nIts equal parts beautiful and masterful and insufferable.",
    "pageCount": 322,
    "yearPublished": 2007
  },
  {
    "title": "The Devil in the White City",
    "author": "Erik Larson",
    "isbn13": "",
    "rating": 3,
    "dateRead": "2022/11/21",
    "shelf": "read",
    "review": "3.5 stars really.\n\nWorlds fair stuff is great. Really interesting to read as a lifelong resident of Chicagoland. Is fun to build a mental map of the places they talk about in the book and learn more about the history of my city. \n\nThe h h homes stuff works less well and is ultimately a little boring",
    "pageCount": 447,
    "yearPublished": 2004
  },
  {
    "title": "Liar's Poker",
    "author": "Michael   Lewis",
    "isbn13": "9780393338690",
    "rating": 4,
    "dateRead": "2022/11/07",
    "shelf": "read",
    "review": "",
    "pageCount": 310,
    "yearPublished": 2010
  },
  {
    "title": "Killers of the Flower Moon: The Osage Murders and the Birth of the FBI",
    "author": "David Grann",
    "isbn13": "",
    "rating": 3,
    "dateRead": "2022/10/23",
    "shelf": "read",
    "review": "We sure did treat the Indians badly, didn’t we(or do we)?\n\nA super compelling story about history, and gross malfeasance and the enduring mistreatment of the Indians. \n\nNot a super compellingly written book.",
    "pageCount": 347,
    "yearPublished": 2017
  },
  {
    "title": "East of Eden",
    "author": "John Steinbeck",
    "isbn13": "",
    "rating": 5,
    "dateRead": "2022/10/12",
    "shelf": "read",
    "review": "What a book. Holy shit.",
    "pageCount": 620,
    "yearPublished": 2002
  },
  {
    "title": "So Good They Can't Ignore You: Why Skills Trump Passion in the Quest for Work You Love",
    "author": "Cal Newport",
    "isbn13": "",
    "rating": 2,
    "dateRead": "2022/09/26",
    "shelf": "read",
    "review": "If you're good at what you do, you'll like your work more. And if you like your work, you'll get better at it, and if you get better at it, you'll like it more. The end.",
    "pageCount": 232,
    "yearPublished": 2012
  },
  {
    "title": "Gone Girl",
    "author": "Gillian Flynn",
    "isbn13": "",
    "rating": 5,
    "dateRead": "2022/09/13",
    "shelf": "read",
    "review": "This book fucking slaps. Truly awesome",
    "pageCount": 561,
    "yearPublished": 2021
  },
  {
    "title": "Slaughterhouse-Five",
    "author": "Kurt Vonnegut Jr.",
    "isbn13": "",
    "rating": 3,
    "dateRead": "2022/09/01",
    "shelf": "read",
    "review": "",
    "pageCount": 231,
    "yearPublished": 2009
  },
  {
    "title": "Sea of Tranquility",
    "author": "Emily St. John Mandel",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2022/08/23",
    "shelf": "read",
    "review": "",
    "pageCount": 226,
    "yearPublished": 2022
  },
  {
    "title": "1984",
    "author": "George Orwell",
    "isbn13": "",
    "rating": 3,
    "dateRead": "2022/08/06",
    "shelf": "read",
    "review": "I forgot how much of this book is a shell for another book.",
    "pageCount": 205,
    "yearPublished": 2021
  },
  {
    "title": "Deep Work: Rules for Focused Success in a Distracted World",
    "author": "Cal Newport",
    "isbn13": "9781455586660",
    "rating": 2,
    "dateRead": "2022/07/26",
    "shelf": "read",
    "review": "There’s a lot of good stuff in here about prioritizing your time and allowing yourself to focus on what’s really important. I do contend that for a professor and writer, what makes his time more flexible than the standard office worker, makes this an easier task for him than the rest of us. \n\nHe does offer strategy’s for reducing the amount of shallow work and establish times to focus, which I’ve taken into my workweeks and have noticed positive changes and better work output. \n\nIt’s good and there’s lots of value here, but it’s not a book for everyone and certainly only really applies to certain trades.",
    "pageCount": 286,
    "yearPublished": 2016
  },
  {
    "title": "Siddhartha (Modern Library Classics)",
    "author": "Hermann Hesse",
    "isbn13": "",
    "rating": 3,
    "dateRead": "2022/07/20",
    "shelf": "read",
    "review": "For someone relatively uninitiated in Bhuddism, this seems like Bhuddism 101. It’s a fast read and a reminder to be present, be open, understand yourself and know yourself, and know that all things are the same.",
    "pageCount": 162,
    "yearPublished": 0
  },
  {
    "title": "Educated",
    "author": "Tara Westover",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2022/07/12",
    "shelf": "read",
    "review": "Tara Westover is a remarkable person. I'm blown away by not only her story, but her resilience, self-awareness, dedication to herself and to growth, and courage to publish such a memoir. A true inspiration of self determination and personal growth. holy shit.",
    "pageCount": 335,
    "yearPublished": 2018
  },
  {
    "title": "Anxious People",
    "author": "Fredrik Backman",
    "isbn13": "9781501160851",
    "rating": 2,
    "dateRead": "2022/06/27",
    "shelf": "read",
    "review": "I enjoyed the themes in this book and it’s overall message, I thought it was a bit of a mess both in its tone and in the prose. Backman is at his best when he’s writing about the state of the world and human reactions to their past, present, and future. He’s good at the quiet moments.\n\nI don’t know if it’s an issue with the translation from Swedish or differences in culture, but I felt The dialogue, especially in the interview scenes, felt incredibly try hard and ham fisted.\n\nThis book seemed to not know whether it wanted to be an inspiration, a character study, a comedy, a crime story, or what.\n\nI greatly liked small portions of it. The first few chapters and last few chapters especially. The middle I continued to read just to finish it.",
    "pageCount": 346,
    "yearPublished": 2020
  },
  {
    "title": "Jurassic Park (Jurassic Park, #1)",
    "author": "Michael Crichton",
    "isbn13": "9780307763051",
    "rating": 4,
    "dateRead": "2022/06/16",
    "shelf": "read",
    "review": "",
    "pageCount": 466,
    "yearPublished": 2012
  },
  {
    "title": "Station Eleven",
    "author": "Emily St. John Mandel",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2022/05/28",
    "shelf": "read",
    "review": "I wish I had read this before I saw the show. The book sets a great feeling, creates a world and lets you live in it. It was improved upon in nearly every way by the TV series, although that is no fault of this book.\n\nA fast read.",
    "pageCount": 353,
    "yearPublished": 2021
  },
  {
    "title": "The Corrections",
    "author": "Jonathan Franzen",
    "isbn13": "9781841156736",
    "rating": 3,
    "dateRead": "2022/05/04",
    "shelf": "read",
    "review": "",
    "pageCount": 653,
    "yearPublished": 2002
  },
  {
    "title": "Chuck Klosterman X: A Highly Specific, Defiantly Incomplete History of the Early 21st Century",
    "author": "Chuck Klosterman",
    "isbn13": "9780735285477",
    "rating": 3,
    "dateRead": "2022/04/15",
    "shelf": "read",
    "review": "Pretty standard Chuck K. Always entertaining and interesting, but the interest of the subject matter varies widely based on the subject matter of the essay.",
    "pageCount": 11,
    "yearPublished": 2017
  },
  {
    "title": "Lolita",
    "author": "Vladimir Nabokov",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2022/02/17",
    "shelf": "read",
    "review": "",
    "pageCount": 368,
    "yearPublished": 1995
  },
  {
    "title": "Four Thousand Weeks: Time Management for Mortals",
    "author": "Oliver Burkeman",
    "isbn13": "9780374159122",
    "rating": 4,
    "dateRead": "2022/02/01",
    "shelf": "read",
    "review": "The best way to manage your time is to not manage it, or at least care so much about being productive. We're all going to die very shortly and productivity for productivities sake is a bottomless pit.\n\nCare about the things you care about, and make time for those. Everything else can go to hell.",
    "pageCount": 245,
    "yearPublished": 2021
  },
  {
    "title": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "isbn13": "9780316769174",
    "rating": 4,
    "dateRead": "2021/11/01",
    "shelf": "read",
    "review": "",
    "pageCount": 277,
    "yearPublished": 2001
  },
  {
    "title": "Sapiens: A Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "isbn13": "",
    "rating": 4,
    "dateRead": "2021/10/01",
    "shelf": "read",
    "review": "",
    "pageCount": 512,
    "yearPublished": 2015
  },
  {
    "title": "The Road",
    "author": "Cormac McCarthy",
    "isbn13": "9780307265432",
    "rating": 1,
    "dateRead": "2021/09/01",
    "shelf": "read",
    "review": "grey, grey, grey, grey, grey, light black, dark white, grey grey grey, the man hates his dead wife, grey grey, he loves his son(question mark), grey grey grey grey.",
    "pageCount": 241,
    "yearPublished": 2006
  },
  {
    "title": "The Obstacle Is the Way: The Timeless Art of Turning Trials into Triumph",
    "author": "Ryan Holiday",
    "isbn13": "9781591846352",
    "rating": 3,
    "dateRead": "2021/09/01",
    "shelf": "read",
    "review": "",
    "pageCount": 201,
    "yearPublished": 2014
  },
  {
    "title": "The New One: Painfully True Stories from a Reluctant Dad",
    "author": "Mike Birbiglia",
    "isbn13": "9781538701539",
    "rating": 4,
    "dateRead": "2020/06/18",
    "shelf": "read",
    "review": "",
    "pageCount": 257,
    "yearPublished": 2020
  },
  {
    "title": "The Expectant Father: The Ultimate Guide for Dads-to-Be (The New Father, 12)",
    "author": "Armin A. Brott",
    "isbn13": "9780789212139",
    "rating": 4,
    "dateRead": "2020/03/01",
    "shelf": "read",
    "review": "",
    "pageCount": 336,
    "yearPublished": 2015
  },
  {
    "title": "Barrel-Aged Stout and Selling Out: Goose Island, Anheuser-Busch, and How Craft Beer Became Big Business",
    "author": "Josh Noel",
    "isbn13": "9781613737217",
    "rating": 4,
    "dateRead": "2017/01/01",
    "shelf": "read",
    "review": "",
    "pageCount": 400,
    "yearPublished": 2018
  },
  {
    "title": "Madison St. Station",
    "author": "Sam Fels",
    "isbn13": "",
    "rating": 3,
    "dateRead": "2017/01/01",
    "shelf": "read",
    "review": "",
    "pageCount": 292,
    "yearPublished": 2017
  },
  {
    "title": "The Martian",
    "author": "Andy Weir",
    "isbn13": "9780804139021",
    "rating": 4,
    "dateRead": "2016/01/01",
    "shelf": "read",
    "review": "",
    "pageCount": 369,
    "yearPublished": 2014
  },
  {
    "title": "Choke",
    "author": "Chuck Palahniuk",
    "isbn13": "9780385720922",
    "rating": 4,
    "dateRead": "2006/11/01",
    "shelf": "read",
    "review": "",
    "pageCount": 293,
    "yearPublished": 2002
  },
  {
    "title": "Fight Club",
    "author": "Chuck Palahniuk",
    "isbn13": "9780393355949",
    "rating": 4,
    "dateRead": "2005/01/01",
    "shelf": "read",
    "review": "Having not read this in 15 years, I forgot how god the writing is. How it glitches and repeats and distorts and repeats and confuses. It makes you feel like the narrator, wondering if you lost your page or are repeating yourself. \n\nEverything is a copy of a copy of a copy.",
    "pageCount": 224,
    "yearPublished": 2018
  },
  {
    "title": "Sex, Drugs, and Cocoa Puffs: A Low Culture Manifesto",
    "author": "Chuck Klosterman",
    "isbn13": "9780743236010",
    "rating": 4,
    "dateRead": "2005/01/01",
    "shelf": "read",
    "review": "",
    "pageCount": 272,
    "yearPublished": 2004
  },
  {
    "title": "Freakonomics: A Rogue Economist Explores the Hidden Side of Everything",
    "author": "Steven D. Levitt",
    "isbn13": "9780061234002",
    "rating": 5,
    "dateRead": "2004/01/01",
    "shelf": "read",
    "review": "Book changed the way I thought about everything",
    "pageCount": 268,
    "yearPublished": 2006
  },
  {
    "title": "Playworld",
    "author": "Adam Ross",
    "isbn13": "9780385351300",
    "rating": 0,
    "dateRead": "",
    "shelf": "dnf",
    "review": "Putting this one on hold or DNF after 250 pages (50%). It’s well written, but I’m a little bored and there’s so many other books to read. Sorry John Mulaney.",
    "pageCount": 528,
    "yearPublished": 2025
  },
  {
    "title": "Culpability",
    "author": "Bruce Holsinger",
    "isbn13": "9781954118973",
    "rating": 1,
    "dateRead": "",
    "shelf": "dnf",
    "review": "DNF at 100 pages.\n\nThis book sucks. Real bad. I am simply blown away that this has 4+ stars. I'm rating it a 1 so that Goodreads doesn't think I neglected to rate it.\n\nIt's vaguely gesturing at moral quandaries about AI in some of the most abysmal writing you've ever read. I have no faith this author has the intellectual ability or writing talent to actually explore them, without just pointing and saying \"Look!\"\n\nThis author LOVES adjectives. It's an adjective fiesta. Adjectives about just how hot the narrators son is, how great his 6 pack is, how defined his shoulders are. Adjectives about the weather, the house, the craziness of his wife, the blandness of the rich neighbors. How many adjectives can he pack into a sentence? Every sentence needs at least 2. \n\nThe teen texting the ai chatbot is written in a way thats like the way people texted on t9 phones, when you could only send 120 characters. It's a 65 year olds fantasy of how \"the youths\" currently text or talk online. \n\nI *gasped* when he introduced a character that his son is attracted to as being named \"Eurydice Monet\". Eurydice! get it?",
    "pageCount": 357,
    "yearPublished": 2025
  },
  {
    "title": "The Self-Driven Child: The Science and Sense of Giving Your Kids More Control Over Their Lives",
    "author": "William Stixrud",
    "isbn13": "9780735222519",
    "rating": 4,
    "dateRead": "",
    "shelf": "read",
    "review": "",
    "pageCount": 384,
    "yearPublished": 2018
  },
  {
    "title": "The God of the Woods",
    "author": "Liz    Moore",
    "isbn13": "",
    "rating": 2,
    "dateRead": "",
    "shelf": "dnf",
    "review": "DNF after 50%. I was extremely bored by it. Writing is full of fluff and wasted words which made it even more slow moving. Bland characters.",
    "pageCount": 490,
    "yearPublished": 2024
  },
  {
    "title": "The Anatomy of the Swipe: Making Money Move",
    "author": "Ahmed Siddiqui",
    "isbn13": "9781641374484",
    "rating": 0,
    "dateRead": "",
    "shelf": "read",
    "review": "Self imposed crash course as prep for my new job",
    "pageCount": 242,
    "yearPublished": 2020
  },
  {
    "title": "The Creative Act: A Way of Being",
    "author": "Rick Rubin",
    "isbn13": "9780593653425",
    "rating": 0,
    "dateRead": "",
    "shelf": "dnf",
    "review": "",
    "pageCount": 418,
    "yearPublished": 2023
  },
  {
    "title": "15 Commitments of Conscious Leadership",
    "author": "Jim Dethmer",
    "isbn13": "",
    "rating": 0,
    "dateRead": "",
    "shelf": "dnf",
    "review": "",
    "pageCount": 0,
    "yearPublished": 0
  },
  {
    "title": "The Tiger",
    "author": "John Vaillant",
    "isbn13": "9780307593795",
    "rating": 0,
    "dateRead": "",
    "shelf": "dnf",
    "review": "",
    "pageCount": 362,
    "yearPublished": 2010
  },
  {
    "title": "A Constellation of Vital Phenomena",
    "author": "Anthony Marra",
    "isbn13": "",
    "rating": 0,
    "dateRead": "",
    "shelf": "read",
    "review": "",
    "pageCount": 419,
    "yearPublished": 2013
  },
  {
    "title": "Range: Why Generalists Triumph in a Specialized World",
    "author": "David   Epstein",
    "isbn13": "9780735214484",
    "rating": 0,
    "dateRead": "",
    "shelf": "dnf",
    "review": "This book is so long. Even the audiobook on 1.7x speed, its just anecdote after anecdote after anecdote.\n\nI just couldnt do it. It's like many books in this realm. Some data, but mainly just story after story after story. Theres no reason for the audiobook of this to be 14 hours long. Just no need.",
    "pageCount": 339,
    "yearPublished": 2019
  },
  {
    "title": "Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones",
    "author": "James Clear",
    "isbn13": "",
    "rating": 0,
    "dateRead": "",
    "shelf": "dnf",
    "review": "",
    "pageCount": 319,
    "yearPublished": 2018
  },
  {
    "title": "Cyclorama",
    "author": "Adam Langer",
    "isbn13": "9781635578072",
    "rating": 1,
    "dateRead": "",
    "shelf": "dnf",
    "review": "DNF on account of it being badly written, predictable, shallow, and preachy. Two dimensional thin characters and worse than The Newsroom historical retconning. \n\nJust couldn’t handle it anymore.",
    "pageCount": 352,
    "yearPublished": 2022
  },
  {
    "title": "Yeast: The Practical Guide to Beer Fermentation (Brewing Elements)",
    "author": "Chris   White",
    "isbn13": "9780937381960",
    "rating": 4,
    "dateRead": "",
    "shelf": "read",
    "review": "",
    "pageCount": 300,
    "yearPublished": 2010
  }
]
